; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	image1 - mode
	spectrograph0 - mode
	GroundStation1 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star2 - direction
	Star0 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Star7 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star7)
	(supports instrument1 image1)
	(calibration_target instrument1 Star2)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation1)
	(supports instrument2 spectrograph0)
	(supports instrument2 image1)
	(calibration_target instrument2 Star0)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star0)
)
(:goal (and
	(pointing satellite0 Star0)
	(pointing satellite1 Star7)
	(pointing satellite2 GroundStation3)
	(have_image Planet5 image1)
	(have_image Phenomenon6 image1)
	(have_image Star7 spectrograph0)
))

)

; plan
1. (switch_on instrument2 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument2)
   goals met: 0 of 6
2. (calibrate satellite2 instrument2 star0)
   added: (calibrated instrument2)
   goals met: 0 of 6
3. (turn_to satellite2 planet5 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 planet5)
   goals met: 0 of 6
4. (take_image satellite2 planet5 instrument2 image1)
   added: (have_image planet5 image1)
   goals met: 1 of 6
5. (turn_to satellite2 phenomenon6 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 phenomenon6)
   goals met: 1 of 6
6. (turn_to satellite0 star0 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star0)
   goals met: 2 of 6
7. (take_image satellite2 phenomenon6 instrument2 image1)
   added: (have_image phenomenon6 image1)
   goals met: 3 of 6
8. (turn_to satellite1 star7 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 star7)
   goals met: 4 of 6
9. (turn_to satellite2 star7 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 star7)
   goals met: 4 of 6
10. (take_image satellite2 star7 instrument2 spectrograph0)
   added: (have_image star7 spectrograph0)
   goals met: 5 of 6
11. (turn_to satellite2 groundstation3 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 groundstation3)
   goals met: 6 of 6
